# SQL Basics - Complete Guide

## Table of Contents
1. [Introduction to SQL](#introduction)
2. [RDBMS Concepts](#rdbms)
3. [SQL Concepts & Commands](#concepts)
4. [Most Asked SQL Interview Questions](#interview-questions)

---

## 1. Introduction to SQL <a id='introduction'></a>

**SQL (Structured Query Language)** is a standard programming language designed for managing and manipulating relational databases.

### Key Features:
- **Data Query**: Retrieve specific data from databases
- **Data Manipulation**: Insert, update, delete data
- **Data Definition**: Create and modify database structures
- **Data Control**: Manage access permissions

### SQL Categories:
1. **DDL (Data Definition Language)**: CREATE, ALTER, DROP, TRUNCATE
2. **DML (Data Manipulation Language)**: SELECT, INSERT, UPDATE, DELETE
3. **DCL (Data Control Language)**: GRANT, REVOKE
4. **TCL (Transaction Control Language)**: COMMIT, ROLLBACK, SAVEPOINT

## 2. RDBMS (Relational Database Management System) <a id='rdbms'></a>

### What is RDBMS?
RDBMS is a database management system based on the relational model where data is stored in tables (relations) with rows and columns.

### Key Concepts:

#### 2.1 Tables (Relations)
- Organized collection of data in rows and columns
- Each table has a unique name

#### 2.2 Rows (Tuples/Records)
- Horizontal entities in a table
- Represents a single record

#### 2.3 Columns (Attributes/Fields)
- Vertical entities in a table
- Represents a specific data type

#### 2.4 Primary Key
- Unique identifier for each record
- Cannot be NULL
- Only one per table

#### 2.5 Foreign Key
- Links two tables together
- References primary key of another table
- Maintains referential integrity

#### 2.6 Constraints
- **NOT NULL**: Column cannot have NULL values
- **UNIQUE**: All values must be different
- **CHECK**: Values must satisfy a condition
- **DEFAULT**: Sets default value if none provided

### RDBMS Properties (ACID):
- **Atomicity**: All or nothing transactions
- **Consistency**: Data remains valid
- **Isolation**: Concurrent transactions don't interfere
- **Durability**: Committed data is permanent

### Popular RDBMS:
- MySQL
- PostgreSQL
- Oracle
- SQL Server
- SQLite

## 3. SQL Concepts & Commands <a id='concepts'></a>

### 3.1 DDL - Data Definition Language

#### CREATE - Create Database/Table

In [ ]:
-- Create Database
CREATE DATABASE company_db;

-- Create Table
CREATE TABLE employees (
    emp_id INT PRIMARY KEY,
    emp_name VARCHAR(100) NOT NULL,
    department VARCHAR(50),
    salary DECIMAL(10, 2),
    hire_date DATE,
    manager_id INT,
    FOREIGN KEY (manager_id) REFERENCES employees(emp_id)
);

#### ALTER - Modify Table Structure

In [ ]:
-- Add Column
ALTER TABLE employees ADD email VARCHAR(100);

-- Modify Column
ALTER TABLE employees MODIFY COLUMN salary DECIMAL(12, 2);

-- Drop Column
ALTER TABLE employees DROP COLUMN email;

-- Rename Table
ALTER TABLE employees RENAME TO staff;

#### DROP & TRUNCATE

In [ ]:
-- DROP - Removes table completely (structure + data)
DROP TABLE employees;

-- TRUNCATE - Removes all data but keeps structure
TRUNCATE TABLE employees;

### 3.2 DML - Data Manipulation Language

#### INSERT - Add Data

In [ ]:
-- Insert single row
INSERT INTO employees (emp_id, emp_name, department, salary, hire_date)
VALUES (1, 'John Doe', 'IT', 75000.00, '2023-01-15');

-- Insert multiple rows
INSERT INTO employees VALUES 
    (2, 'Jane Smith', 'HR', 65000.00, '2023-02-20', NULL),
    (3, 'Bob Johnson', 'IT', 80000.00, '2023-03-10', 1),
    (4, 'Alice Williams', 'Finance', 70000.00, '2023-04-05', NULL);

#### SELECT - Retrieve Data

In [ ]:
-- Select all columns
SELECT * FROM employees;

-- Select specific columns
SELECT emp_name, salary FROM employees;

-- Select with WHERE clause
SELECT * FROM employees WHERE department = 'IT';

-- Select with multiple conditions
SELECT * FROM employees 
WHERE department = 'IT' AND salary > 70000;

-- Select with ORDER BY
SELECT * FROM employees ORDER BY salary DESC;

-- Select with LIMIT
SELECT * FROM employees LIMIT 5;

#### UPDATE - Modify Data

In [ ]:
-- Update single column
UPDATE employees 
SET salary = 85000.00 
WHERE emp_id = 1;

-- Update multiple columns
UPDATE employees 
SET salary = 90000.00, department = 'Management' 
WHERE emp_id = 3;

#### DELETE - Remove Data

In [ ]:
-- Delete specific rows
DELETE FROM employees WHERE emp_id = 4;

-- Delete with condition
DELETE FROM employees WHERE salary < 60000;

### 3.3 SQL Clauses & Operators

#### WHERE Clause Operators

In [ ]:
-- Comparison Operators: =, !=, <, >, <=, >=
SELECT * FROM employees WHERE salary >= 70000;

-- BETWEEN
SELECT * FROM employees WHERE salary BETWEEN 60000 AND 80000;

-- IN
SELECT * FROM employees WHERE department IN ('IT', 'HR', 'Finance');

-- LIKE (Pattern Matching)
SELECT * FROM employees WHERE emp_name LIKE 'J%';  -- Starts with J
SELECT * FROM employees WHERE emp_name LIKE '%son'; -- Ends with son
SELECT * FROM employees WHERE emp_name LIKE '%oh%'; -- Contains oh

-- IS NULL / IS NOT NULL
SELECT * FROM employees WHERE manager_id IS NULL;
SELECT * FROM employees WHERE manager_id IS NOT NULL;

#### Aggregate Functions

In [ ]:
-- COUNT
SELECT COUNT(*) FROM employees;
SELECT COUNT(DISTINCT department) FROM employees;

-- SUM
SELECT SUM(salary) FROM employees;

-- AVG
SELECT AVG(salary) FROM employees;

-- MIN and MAX
SELECT MIN(salary), MAX(salary) FROM employees;

#### GROUP BY & HAVING

In [ ]:
-- GROUP BY
SELECT department, COUNT(*) as emp_count, AVG(salary) as avg_salary
FROM employees
GROUP BY department;

-- GROUP BY with HAVING (filter groups)
SELECT department, AVG(salary) as avg_salary
FROM employees
GROUP BY department
HAVING AVG(salary) > 70000;

### 3.4 JOINS

Joins combine rows from two or more tables based on related columns.

In [ ]:
-- Sample tables for JOIN examples
CREATE TABLE departments (
    dept_id INT PRIMARY KEY,
    dept_name VARCHAR(50),
    location VARCHAR(50)
);

INSERT INTO departments VALUES
    (1, 'IT', 'Building A'),
    (2, 'HR', 'Building B'),
    (3, 'Finance', 'Building C'),
    (4, 'Marketing', 'Building D');

In [ ]:
-- INNER JOIN (returns matching rows from both tables)
SELECT e.emp_name, e.salary, d.dept_name, d.location
FROM employees e
INNER JOIN departments d ON e.department = d.dept_name;

-- LEFT JOIN (all rows from left table + matching from right)
SELECT e.emp_name, e.salary, d.dept_name, d.location
FROM employees e
LEFT JOIN departments d ON e.department = d.dept_name;

-- RIGHT JOIN (all rows from right table + matching from left)
SELECT e.emp_name, e.salary, d.dept_name, d.location
FROM employees e
RIGHT JOIN departments d ON e.department = d.dept_name;

-- FULL OUTER JOIN (all rows from both tables)
SELECT e.emp_name, e.salary, d.dept_name, d.location
FROM employees e
FULL OUTER JOIN departments d ON e.department = d.dept_name;

-- CROSS JOIN (Cartesian product)
SELECT e.emp_name, d.dept_name
FROM employees e
CROSS JOIN departments d;

### 3.5 Subqueries

A query nested inside another query.

In [ ]:
-- Subquery in WHERE clause
SELECT emp_name, salary
FROM employees
WHERE salary > (SELECT AVG(salary) FROM employees);

-- Subquery with IN
SELECT emp_name
FROM employees
WHERE department IN (SELECT dept_name FROM departments WHERE location = 'Building A');

-- Correlated Subquery
SELECT e1.emp_name, e1.salary, e1.department
FROM employees e1
WHERE salary > (SELECT AVG(salary) FROM employees e2 WHERE e2.department = e1.department);

### 3.6 Set Operations

In [ ]:
-- UNION (combines results, removes duplicates)
SELECT emp_name FROM employees WHERE department = 'IT'
UNION
SELECT emp_name FROM employees WHERE salary > 75000;

-- UNION ALL (combines results, keeps duplicates)
SELECT emp_name FROM employees WHERE department = 'IT'
UNION ALL
SELECT emp_name FROM employees WHERE salary > 75000;

-- INTERSECT (common rows)
SELECT emp_name FROM employees WHERE department = 'IT'
INTERSECT
SELECT emp_name FROM employees WHERE salary > 75000;

-- EXCEPT (rows in first query but not in second)
SELECT emp_name FROM employees WHERE department = 'IT'
EXCEPT
SELECT emp_name FROM employees WHERE salary > 75000;

### 3.7 String Functions

In [ ]:
-- CONCAT
SELECT CONCAT(emp_name, ' - ', department) as employee_info FROM employees;

-- UPPER and LOWER
SELECT UPPER(emp_name), LOWER(department) FROM employees;

-- LENGTH
SELECT emp_name, LENGTH(emp_name) as name_length FROM employees;

-- SUBSTRING
SELECT SUBSTRING(emp_name, 1, 3) as short_name FROM employees;

-- TRIM
SELECT TRIM('  Hello  ') as trimmed;

-- REPLACE
SELECT REPLACE(emp_name, 'John', 'Jonathan') FROM employees;

### 3.8 Date Functions

In [ ]:
-- Current Date and Time
SELECT CURRENT_DATE, CURRENT_TIME, NOW();

-- Date Extraction
SELECT YEAR(hire_date), MONTH(hire_date), DAY(hire_date) FROM employees;

-- Date Difference
SELECT emp_name, DATEDIFF(CURRENT_DATE, hire_date) as days_employed FROM employees;

-- Date Add
SELECT DATE_ADD(hire_date, INTERVAL 1 YEAR) as anniversary FROM employees;

### 3.9 Views

Virtual tables based on SQL queries.

In [ ]:
-- Create View
CREATE VIEW high_earners AS
SELECT emp_name, salary, department
FROM employees
WHERE salary > 70000;

-- Use View
SELECT * FROM high_earners;

-- Drop View
DROP VIEW high_earners;

### 3.10 Indexes

Improve query performance by creating indexes on columns.

In [ ]:
-- Create Index
CREATE INDEX idx_department ON employees(department);

-- Create Unique Index
CREATE UNIQUE INDEX idx_emp_id ON employees(emp_id);

-- Drop Index
DROP INDEX idx_department ON employees;

---
## 4. Most Asked SQL Interview Questions <a id='interview-questions'></a>

### Question 1: Find the Second Highest Salary

**Problem**: Write a query to find the second highest salary from the employees table.

In [ ]:
-- Solution 1: Using LIMIT and OFFSET
SELECT DISTINCT salary
FROM employees
ORDER BY salary DESC
LIMIT 1 OFFSET 1;

-- Solution 2: Using Subquery
SELECT MAX(salary) as second_highest
FROM employees
WHERE salary < (SELECT MAX(salary) FROM employees);

-- Solution 3: Using DENSE_RANK (Window Function)
SELECT salary
FROM (
    SELECT salary, DENSE_RANK() OVER (ORDER BY salary DESC) as rank
    FROM employees
) ranked
WHERE rank = 2;

### Question 2: Find Duplicate Records

**Problem**: Find all duplicate employee names in the employees table.

In [ ]:
-- Solution
SELECT emp_name, COUNT(*) as count
FROM employees
GROUP BY emp_name
HAVING COUNT(*) > 1;

### Question 3: Delete Duplicate Records

**Problem**: Delete duplicate records keeping only one instance.

In [ ]:
-- Solution using ROW_NUMBER
DELETE FROM employees
WHERE emp_id IN (
    SELECT emp_id
    FROM (
        SELECT emp_id, ROW_NUMBER() OVER (PARTITION BY emp_name ORDER BY emp_id) as rn
        FROM employees
    ) t
    WHERE rn > 1
);

### Question 4: Nth Highest Salary

**Problem**: Write a query to find the Nth highest salary.

In [ ]:
-- Solution for 3rd highest salary
SELECT DISTINCT salary
FROM employees e1
WHERE 3 = (
    SELECT COUNT(DISTINCT salary)
    FROM employees e2
    WHERE e2.salary >= e1.salary
);

-- Alternative using DENSE_RANK
SELECT salary
FROM (
    SELECT salary, DENSE_RANK() OVER (ORDER BY salary DESC) as rank
    FROM employees
) ranked
WHERE rank = 3;  -- Change 3 to N for Nth highest

### Question 5: Employees Earning More Than Their Managers

**Problem**: Find employees who earn more than their managers.

In [ ]:
-- Solution using Self Join
SELECT e.emp_name as employee, e.salary as emp_salary, 
       m.emp_name as manager, m.salary as mgr_salary
FROM employees e
JOIN employees m ON e.manager_id = m.emp_id
WHERE e.salary > m.salary;

### Question 6: Department-wise Highest Salary

**Problem**: Find the highest salary in each department.

In [ ]:
-- Solution 1: Using GROUP BY
SELECT department, MAX(salary) as highest_salary
FROM employees
GROUP BY department;

-- Solution 2: With employee names
SELECT e.department, e.emp_name, e.salary
FROM employees e
WHERE e.salary = (
    SELECT MAX(salary)
    FROM employees e2
    WHERE e2.department = e.department
);

### Question 7: Cumulative Sum

**Problem**: Calculate cumulative salary for each employee ordered by emp_id.

In [ ]:
-- Solution using Window Function
SELECT emp_id, emp_name, salary,
       SUM(salary) OVER (ORDER BY emp_id) as cumulative_salary
FROM employees;

### Question 8: Rank Employees by Salary

**Problem**: Rank employees by salary (handle ties differently).

In [ ]:
-- ROW_NUMBER: Unique rank even for ties (1,2,3,4,5)
SELECT emp_name, salary,
       ROW_NUMBER() OVER (ORDER BY salary DESC) as row_num
FROM employees;

-- RANK: Same rank for ties, skip next (1,2,2,4,5)
SELECT emp_name, salary,
       RANK() OVER (ORDER BY salary DESC) as rank
FROM employees;

-- DENSE_RANK: Same rank for ties, no skip (1,2,2,3,4)
SELECT emp_name, salary,
       DENSE_RANK() OVER (ORDER BY salary DESC) as dense_rank
FROM employees;

### Question 9: Find Employees Hired in Last 90 Days

**Problem**: Get all employees hired in the last 90 days.

In [ ]:
-- Solution
SELECT emp_name, hire_date
FROM employees
WHERE hire_date >= DATE_SUB(CURRENT_DATE, INTERVAL 90 DAY);

-- Alternative
SELECT emp_name, hire_date
FROM employees
WHERE DATEDIFF(CURRENT_DATE, hire_date) <= 90;

### Question 10: Departments with More Than 5 Employees

**Problem**: Find departments that have more than 5 employees.

In [ ]:
-- Solution
SELECT department, COUNT(*) as emp_count
FROM employees
GROUP BY department
HAVING COUNT(*) > 5;

### Question 11: Self Join - Employee and Manager Names

**Problem**: Display employee name along with their manager's name.

In [ ]:
-- Solution
SELECT e.emp_name as Employee, m.emp_name as Manager
FROM employees e
LEFT JOIN employees m ON e.manager_id = m.emp_id;

### Question 12: Swap Salary Values

**Problem**: Swap salary values between two specific employees.

In [ ]:
-- Swap salaries of emp_id 1 and 2
UPDATE employees
SET salary = CASE 
    WHEN emp_id = 1 THEN (SELECT salary FROM employees WHERE emp_id = 2)
    WHEN emp_id = 2 THEN (SELECT salary FROM employees WHERE emp_id = 1)
    ELSE salary
END
WHERE emp_id IN (1, 2);

### Question 13: Find Consecutive Numbers

**Problem**: Find numbers that appear at least three times consecutively.

In [ ]:
-- Sample table
CREATE TABLE logs (
    id INT PRIMARY KEY,
    num INT
);

INSERT INTO logs VALUES (1,1), (2,1), (3,1), (4,2), (5,1), (6,2), (7,2);

-- Solution
SELECT DISTINCT l1.num as ConsecutiveNums
FROM logs l1
JOIN logs l2 ON l1.id = l2.id - 1 AND l1.num = l2.num
JOIN logs l3 ON l2.id = l3.id - 1 AND l2.num = l3.num;

### Question 14: Pivot Table - Convert Rows to Columns

**Problem**: Convert department-wise employee count from rows to columns.

In [ ]:
-- Solution using CASE
SELECT 
    SUM(CASE WHEN department = 'IT' THEN 1 ELSE 0 END) as IT,
    SUM(CASE WHEN department = 'HR' THEN 1 ELSE 0 END) as HR,
    SUM(CASE WHEN department = 'Finance' THEN 1 ELSE 0 END) as Finance
FROM employees;

### Question 15: Running Total by Department

**Problem**: Calculate running total of salaries within each department.

In [ ]:
-- Solution
SELECT emp_id, emp_name, department, salary,
       SUM(salary) OVER (PARTITION BY department ORDER BY emp_id) as running_total
FROM employees
ORDER BY department, emp_id;

### Question 16: Find Gap in Sequence

**Problem**: Find missing employee IDs in sequence.

In [ ]:
-- Solution
SELECT e1.emp_id + 1 as missing_id
FROM employees e1
LEFT JOIN employees e2 ON e1.emp_id + 1 = e2.emp_id
WHERE e2.emp_id IS NULL
AND e1.emp_id < (SELECT MAX(emp_id) FROM employees);

### Question 17: Top N Salaries per Department

**Problem**: Find top 2 highest salaries in each department.

In [ ]:
-- Solution
SELECT department, emp_name, salary
FROM (
    SELECT department, emp_name, salary,
           DENSE_RANK() OVER (PARTITION BY department ORDER BY salary DESC) as rank
    FROM employees
) ranked
WHERE rank <= 2;

### Question 18: Calculate Age from Date of Birth

**Problem**: Calculate employee age from hire_date (assuming hire_date represents DOB for this example).

In [ ]:
-- Solution
SELECT emp_name, hire_date,
       TIMESTAMPDIFF(YEAR, hire_date, CURRENT_DATE) as years_since_hire
FROM employees;

-- Alternative
SELECT emp_name, hire_date,
       FLOOR(DATEDIFF(CURRENT_DATE, hire_date) / 365) as years_since_hire
FROM employees;

### Question 19: Find Employees with Same Salary

**Problem**: Find all pairs of employees who have the same salary.

In [ ]:
-- Solution
SELECT e1.emp_name as Employee1, e2.emp_name as Employee2, e1.salary
FROM employees e1
JOIN employees e2 ON e1.salary = e2.salary AND e1.emp_id < e2.emp_id;

### Question 20: Complex Query - Department Statistics

**Problem**: Get comprehensive department statistics including count, avg salary, min, max, and total salary.

In [ ]:
-- Solution
SELECT 
    department,
    COUNT(*) as employee_count,
    ROUND(AVG(salary), 2) as avg_salary,
    MIN(salary) as min_salary,
    MAX(salary) as max_salary,
    SUM(salary) as total_salary,
    ROUND(SUM(salary) * 100.0 / (SELECT SUM(salary) FROM employees), 2) as salary_percentage
FROM employees
GROUP BY department
ORDER BY total_salary DESC;

---
## Summary

This notebook covered:
1. **SQL Fundamentals**: DDL, DML, DCL, TCL
2. **RDBMS Concepts**: Tables, Keys, Constraints, ACID properties
3. **SQL Commands**: CREATE, SELECT, INSERT, UPDATE, DELETE, JOIN, etc.
4. **Advanced Topics**: Subqueries, Window Functions, Aggregations
5. **20 Most Asked Interview Questions** with multiple solution approaches

### Key Takeaways:
- Practice writing queries regularly
- Understand execution order: FROM → WHERE → GROUP BY → HAVING → SELECT → ORDER BY
- Master JOINs and subqueries
- Learn window functions for advanced analytics
- Optimize queries using indexes

### Next Steps:
1. Practice these queries on a real database
2. Explore database-specific features (MySQL, PostgreSQL, etc.)
3. Learn query optimization and execution plans
4. Study database design and normalization
5. Work on real-world projects